//=============================================================================
//
// エディター処理 [Edit.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "Edit.h"
#include "Manager.h"
#include "SkyCube.h"
#include "Parameter.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
CBlock* CEdit::m_pBlock = nullptr;						// ブロックへのポインタ
CImGuiManager* CEdit::m_pImGuiManager = nullptr;		// ImGuiマネージャーへのポインタ
std::unique_ptr<CBlockManager> CEdit::m_pBlockManager = nullptr;

namespace Create
{
	const D3DXVECTOR3 PLAYER_POS{ 0.0f, 100.0f, 0.0f };
}

namespace EditLight
{
	const LightParam LIGHTS[] =
	{
		{ D3DLIGHT_DIRECTIONAL, {0.9f, 0.9f, 0.9f, 1.0f}, {0.0f, -1.0f, 0.0f},{0,0,0} },
		{ D3DLIGHT_DIRECTIONAL, {0.3f, 0.3f, 0.3f, 1.0f}, {0.0f, 1.0f, 0.0f },{0,0,0} },
		{ D3DLIGHT_DIRECTIONAL, {0.7f, 0.7f, 0.7f, 1.0f}, {1.0f, 0.0f, 0.0f },{0,0,0} },
		{ D3DLIGHT_DIRECTIONAL, {0.7f, 0.7f, 0.7f, 1.0f}, {-1.0f, 0.0f, 0.0f},{0,0,0} },
		{ D3DLIGHT_DIRECTIONAL, {0.7f, 0.7f, 0.7f, 1.0f}, {0.0f, 0.0f, 1.0f },{0,0,0} },
		{ D3DLIGHT_DIRECTIONAL, {0.7f, 0.7f, 0.7f, 1.0f}, {0.0f, 0.0f, -1.0f},{0,0,0} }
	};
}

//=============================================================================
// コンストラクタ
//=============================================================================
CEdit::CEdit() : CScene(CScene::MODE_EDIT)
{
	// 値のクリア
	m_pPlayer = nullptr;
}
//=============================================================================
// デストラクタ
//=============================================================================
CEdit::~CEdit()
{
	// なし
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CEdit::Init(void)
{
	// ブロックマネージャーの生成
	m_pBlockManager = CBlockManager::Create();

	// ブロックマネージャーの初期化
	m_pBlockManager->Init();

	// スカイキューブの生成
	CSkyCube::Create();

	// グリッドの生成
	m_pGrid = CGrid::Create();

	// グリッドの初期化
	m_pGrid->Init();

	// JSONの読み込み
	m_pBlockManager->LoadFromJson("data/STAGE/test.json");

	// プレイヤーの生成
	m_pPlayer = CPlayer::Create(Create::PLAYER_POS, INIT_VEC3);

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CEdit::Uninit(void)
{


}
//=============================================================================
// 更新処理
//=============================================================================
void CEdit::Update(void)
{
	// ブロックマネージャーの更新処理
	m_pBlockManager->Update();
}
//=============================================================================
// 描画処理
//=============================================================================
void CEdit::Draw(void)
{
	// グリッドの描画
	m_pGrid->Draw();
}
//=============================================================================
// デバイスリセット通知
//=============================================================================
void CEdit::OnDeviceReset(void)
{
	// ライトの終了処理
	CLight::Uninit();

	// ライトの設定処理
	for (const auto& light : EditLight::LIGHTS)
	{
		CLight::AddLight(light.type, light.color, light.dir, light.pos);
	}
}
//=============================================================================
// サムネイルリリース通知
//=============================================================================
void CEdit::ReleaseThumbnail(void)
{
	m_pBlockManager->ReleaseThumbnailRenderTarget();
}
//=============================================================================
// サムネイルリセット通知
//=============================================================================
void CEdit::ResetThumbnail(void)
{
	m_pBlockManager->InitThumbnailRenderTarget(CManager::GetRenderer()->GetDevice());
	m_pBlockManager->GenerateThumbnailsForResources(); // キャッシュも再作成
}