//=============================================================================
//
// メイン処理 [Main.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _MAIN_H_// このマクロ定義がされていなかったら
#define _MAIN_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// メインプロセスクラス
//*****************************************************************************
class CMainProc
{
public:
	CMainProc();
	~CMainProc();

	void ToggleFullScreen(HWND hWnd);

private:
	RECT m_Windowrect;	// ウィンドウの幅
};

#endif